# REQUIRED
cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# System
brew "git"                            # newer Git
brew "bash"                           # newer Bash
brew "bash-completion"                # Bash Completion
brew "jq"                             # JSON Query
brew "tree"
brew "coreutils"                      # Core Utils
brew "gnu-sed"                        # GNU Sed
brew "htop"                           # Improved top (interactive process viewer)
brew "ffmpeg"                         # FFMpeg
brew "fortune"
brew "cowsay"
brew "lolcat"

cask "iterm2"                         # iTerm2 terminal
cask "dd-utility"                     # UI For DD

# Programming - Tooling
brew "graphviz"                       # GraphVizard
brew "ctags"
cask "postman"

cask "font-fira-code"                 # FiraCode

cask "vmware-fusion"                  # VMWARE Tools
cask "virtualbox"                     # VirtualBox VM from Oracle
cask "vagrant"                        # Hashicorp Vagrant
cask "docker"                         # Docker

cask "sourcetree"                     # SourceTree
cask "cronnix"                        # Cron UI
cask "visual-studio-code"             # Visual Studio Code

# Clouds
brew "awscli"                         # AWS Cli
brew "azure-cli"                      # Azure
cask "google-cloud-sdk"               # google cloud

# DevOps Tools
brew "serverless"                     # Serverless Framework
brew "ansible"                        # Configuration Management

# Kubernetes
brew "kubernetes-cli"
brew "kubernetes-helm"
cask "minikube"
brew "kustomize"
brew "istioctl"
brew "skaffold"
brew "pre-commit"

# Hashicorp Tools
brew "consul"                         #
brew "vault"                          #
brew "packer"                         #
brew "terraform"                      #

# Missing Unix tools
brew "pstree"                         # pstree
brew "psgrep"                         # psgrep
brew "pkill"                          # pkill
cask "sampler"                        # https://github.com/sqshq/sampler
brew "shellcheck"                     # bash linter

# Mac Applications
cask "google-chrome"                  # Browser
cask "fantastical"                    # Fantastical

cask "iina"                           # Video Player
cask "handbrake"                      # Image Converting
cask "imageoptim"                     # Image Optim
brew "youtube-dl"                     # yt-dl, but not as pip.

# utils
cask "dropbox"
cask "appcleaner"
cask "ankiapp-anki"
cask "istat-menus"
cask "little-snitch"
cask "keka"

# messages
cask "slack"
cask "skype"
cask "telegram-desktop"

# Mac Applications - AppStore
mas "Apple Remote Desktop",        id: 409907375      # ARD
mas "Audiobook Builder",           id: 406226796      # Older Version
mas "Helium",                      id: 1054607607     # Helium
mas "Divvy - Window Manager",      id: 413857545      # Divvy
mas "Horo - Timer for Menu Bar",   id: 1437226581     # Horo Timer
mas "KubeContext",                 id: 1438838068     # KubeContext

# temporary disabled unused applications
# mas "Encrypto: Secure Your Files", id: 413857545      # 935235287
# mas "Evolve Tracking Freelancer",  id: 1286846351


# Fonts
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-fira-mono'
