# REQUIRED
cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# System
brew "git"                            # newer Git
brew "bash"                           # newer Bash
brew "bash-completion"                # Bash Completion
brew "jq"                             # JSON Query
brew "tree"
brew "coreutils"                      # Core Utils
brew "htop"                           # Improved top (interactive process viewer)
brew "ffmpeg"                         # FFMpeg
brew "fortune"
brew "cowsay"
brew "lolcat"

cask "iterm2"                         # iTerm2 terminal
cask "dd-utility"                     # UI For DD

# Programming - Tooling
brew "graphviz"                       # GraphVizard
brew "ctags"

cask "font-fira-code"                 # FiraCode

cask "vmware-fusion"                  # VMWARE Tools
cask "virtualbox"                     # VirtualBox VM from Oracle
cask "vagrant"                        # Hashicorp Vagrant
cask "docker"                         # Docker

cask "sourcetree"                     # SourceTree
cask "cronnix"                        # Cron UI
cask "visual-studio-code"             # Visual Studio Code

# Clouds
brew "awscli"                         # AWS Cli
brew "azure-cli"                      # Azure

# DevOps Tools
brew "serverless"                     # Serverless Framework
brew "ansible"                        # Configuration Management

# Kubernetes
brew "kubernetes-cli"
brew "kubernetes-helm"

# Hashicorp Tools
brew "consul"                         #
brew "vault"                          #
brew "packer"                         #
brew "terraform"                      #


# Mac Applications
cask "google-chrome"                  # Browser
cask "fantastical"                    # Fantastical

cask "iina"                           # Video Player
cask "handbrake"                      # Image Converting
cask "imageoptim"                     # Image Optim

# utils
cask "dropbox"
cask "appcleaner"
cask "ankiapp-anki"
cask "istat-menus"
cask "the-unarchiver"
cask "little-snitch"

# messages
cask "slack"
cask "skype"
cask "telegram-desktop"

# Mac Applications - AppStore
mas "Apple Remote Desktop",   id: 409907375      # ARD
mas "Audiobook Builder",      id: 406226796      # Older Version
mas "Helium",                 id: 1054607607     # Helium
mas "Divvy - Window Manager", id: 413857545      # Divvy
